---
layout: default
title: 思科的网络设备
author: lijiaocn
createdate: 2016/05/27 22:21:43
changedate: 2017/10/28 11:27:34
categories: 技巧
tags: 硬件
keywords:
description: 

---

## 摘要

## 思科网络设备命名规则

IOS软件版本命名:  [http://www.ciscopress.com/articles/article.asp?p=2106547](http://www.ciscopress.com/articles/article.asp?p=2106547)

路由器命名: [link](http://wenku.baidu.com/link?url=-X3l8jtQrG-FP4KYIIYfLGl6cRtDBGo5E4kAuxFECsYXjd0uUxVgTd-Fng-EmLXBU9z2-yxSMp4oYUR-6SjWpHtEgVtaFJibTYVNLJGVb0e)

	c7200-advipservicesk9-mz.152-4.S5.bin
	
	c:  cisco开头，表示是路由器
	72: 表示系列

交换机:

	WS-C3750G-48TS-S
	WS:     交换机
	C/X:    C, 固化交换机/机箱   X, 模块
	3750:   系列
	G:      支持千兆或者以上，没有表示
	48:     48个以太口， 
	TS:     电口, Twist Pair
	S:      标准版，E增强版

## 思科网络模块

NM-1FE-TX:  

	路由模块，Ip Multicast IS-IS
	NM:  网络模块
	1FE: 一个快速以太口
	TX:  电口

NM-4T:

	 4端口高速串行同步专线网络模块, 4个serial接口

NM-16ESW:

	16个Fastethernet接口, 交换模块 Vlan EhternetChannel Spanning-tree

## 思科IOS常用操作

?:

	查看当前模式下，所有可用的命令。

cli模式:

	user Exec
	privileged EXEC  
	global configuration 
	specific configuration(interface configuration...)

查看interface:

	show interface

>可以使用管道

进入退出特权模式:

	enable
	disable

进入全局配置模式:

	在特权模式下执行, configure terminal
	R1#configure terminal
	Enter configuration commands, one per line.  End with CNTL/Z.
	R1(config)#

进入接口配置模式:

	在全局配置模式下:
	interface  接口类型  接口编号
	R1(config)#interface fastEthernet 1/1
	R1(config-if)#

保存配置:

	copy system:running-config nvram:startup-config

创建vlan:

	ESW1>enable
	ESW1#vlan database
	ESW1(vlan)#vlan 20
	VLAN 20 added:
	    Name: VLAN0020
	ESW1(vlan)#exit
	APPLY completed.
	Exiting....

将单个接口接入vlan:

	ESW1>enable
	ESW1#conf
	ESW1#configure te
	ESW1#configure terminal
	Enter configuration commands, one per line.  End with CNTL/Z.
	ESW1(config)#interface fastEthernet 2/0
	ESW1(config-if)#switchport access vlan 20

查看vlan情况:

	ESW1>show vlan-switch
	
	VLAN Name                             Status    Ports
	---- -------------------------------- --------- -------------------------------
	1    default                          active    Fa2/1, Fa2/2, Fa2/3, Fa2/4
	                                                Fa2/5, Fa2/6, Fa2/7, Fa2/8
	                                                Fa2/9, Fa2/10, Fa2/11, Fa2/12
	                                                Fa2/13, Fa2/14, Fa2/15
	10   VLAN0010                         active    Fa1/0, Fa1/1, Fa1/2, Fa1/3
	                                                Fa1/4, Fa1/5, Fa1/6, Fa1/7
	                                                Fa1/8, Fa1/9, Fa1/10, Fa1/11
	                                                Fa1/12, Fa1/13, Fa1/14, Fa1/15
	20   VLAN0020                         active    Fa2/0

批量配置端口:

	ESW1>enable
	ESW1#configure terminal
	Enter configuration commands, one per line.  End with CNTL/Z.
	ESW1(config)#interface range fastEthernet 2/0 - 15            <-- 端口0-15
	ESW1(config-if-range)#switchport access vlan 20

查看vlan IP

	show  ip interface  vlan 10

为vlan配置IP

	ESW1(config)#interface vlan 20
	ESW1(config-if)#ip address 192.168.20.1 255.255.255.0
	ESW1(config-if)#no shutdown

SVI:switch virtual interface, 交换机虚拟接口。

